{
  "leia_organa": {
    "name": "Leia Organa",
    "height": "150",
    "mass": "49",
    "hair_color": "brown",
    "skin_color": "light",
    "eye_color": "brown",
    "birth_year": "19BBY",
    "gender": "female",
    "description": "Leia Organa Solo (born Leia Amidala Skywalker) was, at various stages of her life, a politician, revolutionary, and Jedi Knight of the New Jedi Order. The daughter of Jedi Knight Anakin Skywalker and Senator Padmé Amidala of Naboo, Leia was the younger twin sister of Luke Skywalker, and, shortly after her birth, she became the adopted daughter of Bail Organa and Queen Breha of Alderaan, making her a Princess of Alderaan.",
    "image": "http://img1.wikia.nocookie.net/__cb20080506155343/starwars/images/8/89/Leia_endorpromo02.jpg"
  },
  "bib_fortuna": {
    "name": "Bib Fortuna",
    "height": "180",
    "mass": "unknown",
    "hair_color": "none",
    "skin_color": "pale",
    "eye_color": "pink",
    "birth_year": "unknown",
    "gender": "male",
    "description": "Bib Fortuna was a male Twi'lek from Ryloth. Bib served as a majordomo to Jabba Desilijic Tiure for many years. Considering he served Jabba for decades, it is unsurprising that few in the galaxy hated the Hutt as much as he did—the Twi'lek majordomo had tried many times unsuccessfully to have Jabba killed. A member of the Una Clan, Bib Fortuna was friendly with many B'omarr monks in Jabba's Palace—when he died, his brain was forcibly removed from his body by the ancient religious order.",
    "image": "http://img4.wikia.nocookie.net/__cb20130326042806/starwars/images/3/33/BibFortunaHS-ROTJ.png"
  },
  "biggs_darklighter": {
    "name": "Biggs Darklighter",
    "height": "183",
    "mass": "84",
    "hair_color": "black",
    "skin_color": "light",
    "eye_color": "brown",
    "birth_year": "24BBY",
    "gender": "male",
    "description": "Biggs Darklighter was a Human male starfighter pilot who served the Alliance to Restore the Republic and a childhood friend of Luke Skywalker during the time of the Galactic Civil War. Darklighter flew a T-65 X-wing starfighter with Red Squadron during the Battle of Yavin as Red Three, where he perished. Darklighter was born on Tatooine to the local agricultural magnate Huff Darklighter and his wife. He was raised a privileged child.",
    "image": "http://img1.wikia.nocookie.net/__cb20131010203100/starwars/images/5/5e/DewbackAttack-SWI35.jpg"
  },
  "boba_fett": {
    "name": "Boba Fett",
    "height": "183",
    "mass": "78.2",
    "hair_color": "black",
    "skin_color": "fair",
    "eye_color": "brown",
    "birth_year": "31.5BBY",
    "gender": "male",
    "description": "Boba Fett was a Mandalorian warrior and bounty hunter. He was the only unaltered clone of the famed Jango Fett, created in 32 BBY as unit A0050, one of the first of many Fett replicas designed to become part of the Grand Army of the Republic, and was raised as Jango's son. Jango taught Boba much, training him to become a skilled bounty hunter as was his father-figure before him. In 22 BBY, Jango was killed at the Battle of Geonosis, which opened the Clone Wars.",
    "image": "http://img2.wikia.nocookie.net/__cb20130920001614/starwars/images/5/58/BobaFettMain2.jpg"
  },
  "bossk": {
    "name": "Bossk",
    "height": "190",
    "mass": "113",
    "hair_color": "none",
    "skin_color": "green",
    "eye_color": "red",
    "birth_year": "53BBY",
    "gender": "male",
    "description": "Bossk (meaning \"Devours His Prey\" in Dosh) was a male Trandoshan bounty hunter who was the pilot of the Hound's Tooth and held the title of monarch of the Qotile system. He was not particularly fond of Chewbacca and his Human partner Han Solo. He would face them several times, and would be one of the six bounty hunters Darth Vader hired to track down and capture the Millennium Falcon.",
    "image": "http://img3.wikia.nocookie.net/__cb20130219044712/starwars/images/thumb/1/1d/Bossk.png/500px-Bossk.png"
  },
  "c-3po": {
    "name": "C-3PO",
    "height": "167",
    "mass": "75",
    "hair_color": "n/a",
    "skin_color": "gold",
    "eye_color": "yellow",
    "birth_year": "112BBY",
    "gender": "n/a",
    "description": "C-3PO, sometimes spelled See-Threepio and often referred to as Threepio, was a bipedal, humanoid protocol droid designed to interact with organics, programmed primarily for etiquette and protocol. He was fluent in over six million forms of communication, and developed a fussy and worry-prone personality throughout his many decades of operation. After being destroyed and discarded on the planet Tatooine before 32 BBY, C-3PO was rebuilt.",
    "image": "http://img3.wikia.nocookie.net/__cb20131005124036/starwars/images/5/51/C-3PO_EP3.png"
  },
  "chewbacca": {
    "name": "Chewbacca",
    "height": "228",
    "mass": "112",
    "hair_color": "brown",
    "skin_color": "unknown",
    "eye_color": "blue",
    "birth_year": "200BBY",
    "gender": "male",
    "description": "Chewbacca (or \"Chewie\", as he was known by his friends) was a legendary Wookiee from Kashyyyk and co-pilot of Han Solo's ship, the Millennium Falcon. He was the son of Attichitcuk, the husband of Mallatobuck, and the father of Lumpawaroo. Chewbacca carried with him the name of an ancient Wookiee hero, the great Bacca, first of the great chieftains of Kashyyyk, and the creator of a sword that denoted leadership among the Wookiees. This name placed Chewbacca in a noble lineage.",
    "image": "http://img4.wikia.nocookie.net/__cb20080815045819/starwars/images/thumb/7/73/Chewbaccaheadshot.jpg/500px-Chewbaccaheadshot.jpg"
  },
  "darth_vader": {
    "name": "Darth Vader",
    "height": "202",
    "mass": "136",
    "hair_color": "none",
    "skin_color": "white",
    "eye_color": "yellow",
    "birth_year": "41.9BBY",
    "gender": "male",
    "description": "Anakin Skywalker was a Force-sensitive Human male who served the Galactic Republic as a Jedi Knight and later served the Galactic Empire as the Sith Lord Darth Vader. Born to the slave Shmi Skywalker in 41.9 BBY, Anakin was conceived by midi-chlorians, the symbiotic organisms that allowed individuals to touch the Force, and he and his mother were brought to the desert planet of Tatooine to be the slaves of Gardulla the Hutt.",
    "image": "http://img1.wikia.nocookie.net/__cb20130621175844/starwars/images/6/6f/Anakin_Skywalker_RotS.png"
  },
  "greedo": {
    "name": "Greedo",
    "height": "173",
    "mass": "74",
    "hair_color": "n/a",
    "skin_color": "green",
    "eye_color": "black",
    "birth_year": "44BBY",
    "gender": "male",
    "description": "Greedo, son of Greedo the Elder, was a male Rodian bounty hunter. He lived in Mos Espa alongside the young Anakin Skywalker and W. Wald circa 32 BBY. Although his father had been an esteemed hunter, and the chief rival of Navik the Red, the younger Greedo had little of his father's prowess and was easily killed by Han Solo in Chalmun's Spaceport Cantina on Tatooine. Greedo was born on Rodia within the ranks of the persecuted Tetsu Clan.",
    "image": "http://img4.wikia.nocookie.net/__cb20111104205225/starwars/images/c/c6/Greedo.jpg"
  },
  "han_solo": {
    "name": "Han Solo",
    "height": "180",
    "mass": "80",
    "hair_color": "brown",
    "skin_color": "fair",
    "eye_color": "brown",
    "birth_year": "29BBY",
    "gender": "male",
    "description": "Han Solo was a Human smuggler from the manufacturing planet Corellia who achieved galactic fame as a member of the Rebel Alliance and later the New Republic. Born on Corellia, he was orphaned at an early age and taken by the pirate Garris Shrike to serve on his crew. He was treated cruelly, and served Shrike for many years before escaping while in his teens. Solo became a smuggler, and fell in love with Bria Tharen, though she left him due to her duties to the Rebel Alliance.",
    "image": "http://img1.wikia.nocookie.net/__cb20100129155042/starwars/images/0/01/Hansoloprofile.jpg"
  },
  "ig-88": {
    "name": "IG-88",
    "height": "200",
    "mass": "140",
    "hair_color": "none",
    "skin_color": "metal",
    "eye_color": "red",
    "birth_year": "15BBY",
    "gender": "none",
    "description": "IG-88 was an IG-series assassin droid-turned-bounty hunter. He and several others were summoned by Darth Vader to the Executor after the Battle of Hoth, and ordered to fulfill the bounty on Han Solo. However, it was Boba Fett who tracked down Solo in the Millennium Falcon. Appearances Star Wars: Galactic Defense, Star Wars: Darth Vader 1: Vader, Star Wars: Episode V The Empire Strikes Back (First appearance)",
    "image": "http://img4.wikia.nocookie.net/__cb20060924205712/starwars/images/a/aa/IG-88B-ESB.jpg"
  },
  "lando_calrissian": {
    "name": "Lando Calrissian",
    "height": "177",
    "mass": "79",
    "hair_color": "black",
    "skin_color": "dark",
    "eye_color": "brown",
    "birth_year": "31BBY",
    "gender": "male",
    "description": "Lando Calrissian was a Human male professional gambler, entrepreneur, smuggler, and general throughout various points in his life. Born on Socorro, he became a gambler and con man early in his life and acquired his own ship, the Millennium Falcon, in a game of sabacc with a man named Cix Trouvee. He went on to have numerous adventures with the Falcon and its piloting droid, Vuffi Raa, during which he ran afoul of a Sorcerer of Tund named Rokur Gepta, whom Calrissian eventually killed.",
    "image": "http://img1.wikia.nocookie.net/__cb20080715214753/starwars/images/7/7d/Lando_WoSW.jpg"
  },
  "lobot": {
    "name": "Lobot",
    "height": "175",
    "mass": "79",
    "hair_color": "none",
    "skin_color": "light",
    "eye_color": "blue",
    "birth_year": "37BBY",
    "gender": "male",
    "description": "Lobot was a Human male who served as the chief administrative aide to Baron Administrator Lando Calrissian on Cloud City over the planet Bespin. His brain was connected to the city's central computer which allowed him to communicate directly with the city's computer network. In this capacity, he served as the city's first and only computer-liaison officer. Lobot was the son of a slaver, who traveled across the galaxy raiding backwater and poor worlds for slaves.",
    "image": "http://img2.wikia.nocookie.net/__cb20110127015046/starwars/images/thumb/9/97/Lobot_NEGTC.jpg/500px-Lobot_NEGTC.jpg"
  },
  "luke_skywalker": {
    "name": "Luke Skywalker",
    "height": "172",
    "mass": "77",
    "hair_color": "blond",
    "skin_color": "fair",
    "eye_color": "blue",
    "birth_year": "19BBY",
    "gender": "male",
    "description": "Luke Skywalker was a Force-sensitive Human male who helped defeat the Galactic Empire in the Galactic Civil War and helped found the New Republic, as well as the New Jedi Order. Born in 19 BBY as the son of the fallen Jedi Knight Anakin Skywalker and the Queen and Senator of Naboo, Padmé Amidala, Luke was raised on Tatooine and hidden from Emperor Palpatine and his father, who had recently become Darth Vader, Dark Lord of the Sith. In 0 BBY, Skywalker's life changed forever.",
    "image": "http://img1.wikia.nocookie.net/__cb20091118055536/starwars/images/e/e2/SwKOTOR25cropped.jpg"
  },
  "mon_mothma": {
    "name": "Mon Mothma",
    "height": "150",
    "mass": "unknown",
    "hair_color": "auburn",
    "skin_color": "fair",
    "eye_color": "blue",
    "birth_year": "48BBY",
    "gender": "female",
    "description": "Mon Mothma, a native of Chandrila, was a female Human who served as an important political figure from the waning days of the Galactic Republic, one of the founders of the Alliance to Restore the Republic, and the first Chief of State of the New Republic. When the foundation of the Galactic Empire replaced the Republic that had existed for many millennia, she met with her allies in the Senate, such as Senators Padmé Amidala and Bail Prestor Organa.",
    "image": "http://img4.wikia.nocookie.net/__cb20070615234013/starwars/images/4/46/Monmothma.jpg"
  },
  "nien_nunb": {
    "name": "Nien Nunb",
    "height": "160",
    "mass": "68",
    "hair_color": "none",
    "skin_color": "grey",
    "eye_color": "black",
    "birth_year": "unknown",
    "gender": "male",
    "description": "Nien Nunb was a Sullustan smuggler. He grew up in the caves of his homeworld, Sullust, with his sister, Aril Nunb. Later, he worked for the SoroSuub Corporation as a smuggler. During one of his smuggling flights, he befriended Lando Calrissian—an individual Nunb would have great deals with in later years. It was with Calrissian that he would copilot the Millennium Falcon during the Battle of Endor.",
    "image": "http://img1.wikia.nocookie.net/__cb20111120232928/starwars/images/c/c7/NienNunbHS-SWE.jpg"
  },
  "obi-wan_kenobi": {
    "name": "Obi-Wan Kenobi",
    "height": "182",
    "mass": "77",
    "hair_color": "auburn, white",
    "skin_color": "fair",
    "eye_color": "blue-gray",
    "birth_year": "57BBY",
    "gender": "male",
    "description": "Obi-Wan Kenobi, later known as Ben Kenobi during his exile, was a legendary Jedi Master who played a significant role in the fate of the galaxy during the waning days of the Galactic Republic. He was the mentor of both Anakin and Luke Skywalker, training both in the ways of the Force. He had a long and tumultuous career that helped shape the fate of the entire galaxy.",
    "image": "http://img3.wikia.nocookie.net/__cb20111115052816/starwars/images/4/4e/ObiWanHS-SWE.jpg"
  },
  "owen_lars": {
    "name": "Owen Lars",
    "height": "178",
    "mass": "120",
    "hair_color": "brown, grey",
    "skin_color": "light",
    "eye_color": "blue",
    "birth_year": "52BBY",
    "gender": "male",
    "description": "Owen Lars was the son of moisture farmer Cliegg Lars and the stepbrother of Anakin Skywalker. He married Beru Whitesun, and after his father's death, inherited his moisture farm. In 19 BBY, Beru convinced Owen to adopt Anakin's son, Luke Skywalker, as Anakin had turned to the dark side and become the infamous Darth Vader. Owen and Beru raised their nephew as well as they could, and Owen instilled into Luke the values of his own childhood.",
    "image": "http://img2.wikia.nocookie.net/__cb20070626181249/starwars/images/thumb/8/81/Owen-OP.jpg/500px-Owen-OP.jpg"
  },
  "wedge_antilles": {
    "name": "Wedge Antilles",
    "height": "170",
    "mass": "77",
    "hair_color": "brown",
    "skin_color": "fair",
    "eye_color": "hazel",
    "birth_year": "21BBY",
    "gender": "male",
    "description": "Wedge Antilles, a Human male, was a famed Corellian pilot and general, known as a hero of the Rebel Alliance and New Republic. Orphaned at age seventeen, he joined the Rebellion after Imperial forces killed his girlfriend, Mala Tinero. A standout starfighter pilot, he was one of the few to survive the Battle of Yavin, after which he founded Rogue Squadron with his friend Luke Skywalker.",
    "image": "http://img2.wikia.nocookie.net/__cb20090818010910/starwars/images/8/80/Young_Wedge.jpg"
  },
  "yoda": {
    "name": "Yoda",
    "height": "66",
    "mass": "17",
    "hair_color": "white",
    "skin_color": "green",
    "eye_color": "brown",
    "birth_year": "896BBY",
    "gender": "male",
    "description": "Yoda was one of the most renowned and powerful Jedi Masters in galactic history. He was known for his legendary wisdom, mastery of the Force and skills in lightsaber combat. Yoda served as a member of the Jedi High Council in the last centuries of the Galactic Republic and as Grand Master oversaw the Jedi Order before, during and after the devastating Clone Wars. Following the First Battle of Geonosis, Yoda held the title of Master of the Order in addition to that of Grand Master.",
    "image": "http://img1.wikia.nocookie.net/__cb20131106213953/starwars/images/d/d6/Yoda_SWSB.png"
  }
}